Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/Trad_Ita-level2.tmx
Source language: en_us
Languages: it_it

source: (A job may contain one or more files to be translated.) After creating the project, you place any translation memories from past jobs (input TMs) that you think might be useful in the \tm\ folder.
it_it: (Un lavoro può contenere uno o più file da tradurre). Dopo aver creato il progetto, si inseriscono eventuali memorie di traduzione di lavori passati (TM di input) che si ritengono possano essere utili, nella cartella \tm\.

source: (OmegaT does enable you to call up your file manager and a particular project within your folder with Project > Access Project Contents.)
it_it: (OmegaT consente di richiamare il file manager e un particolare progetto all'interno della cartella con Progetto> Accedi al contenuti del progetto).

source: (if you are using Linux).
it_it: (se si usa Linux).

source: (if you are using Windows)
it_it: (se si usa Windows)

source: The Auto Save TM script extends the automatic saving of the output TM to a repository as described above.
it_it: Lo script Auto Save TM estende il salvataggio automatico della TM di output in un repository come descritto sopra.

source: A major advantage of the recycled project method is that it spares you a lot of the effort of setting up a project, and in particular of managing translation memories by moving them around in your file manager.
it_it: Uno dei principali vantaggi del metodo del progetto riciclato è che fa risparmiare molti sforzi per impostare un progetto, e in particolare per gestire le memorie di traduzione spostandole nel file manager.

source: A segment is usually a sentence, though it may be just a phrase, or in some cases may span several sentences or even a whole paragraph.
it_it: Un segmento è solitamente una frase, anche se può essere solo una frase o, in alcuni casi, può estendersi su più frasi o addirittura su un intero paragrafo.

source: A translation memory ("TM") is a database in which texts are broken down into segments and stored in "translation units".
it_it: Una memoria di traduzione ("TM") è un database in cui i testi vengono suddivisi in segmenti e memorizzati in "unità di traduzione" [translation units].

source: Advanced TM management using commands and scripts
it_it: Gestione avanzata delle TM tramite comandi e script

source: Advanced TM management using symbolic links
it_it: Gestione avanzata delle TM tramite link simbolici

source: Advantages and drawbacks of the different methods
it_it: Vantaggi e svantaggi dei diversi metodi

source: All the segments from past jobs completed in the recycled project are still present in the project's internal translation memory and are accessible in the form of matches or search results.
it_it: Tutti i segmenti dei lavori passati completati nel progetto riciclato sono ancora presenti nella memoria di traduzione interna del progetto e sono accessibili sotto forma di corrispondenze o risultati di ricerca.

source: As already mentioned, OmegaT does not have dedicated built-in functions for managing translation memories.
it_it: Come già accennato, OmegaT non dispone di funzioni integrate dedicate per la gestione delle memorie di traduzione.

source: As an alternative to using the external post-processing command, you can also use OmegaT's scripting function to manage your TMs. An example implementation is the Save TM As pair of scripts.
it_it: In alternativa all'utilizzo del comando di post-elaborazione esterno, è possibile utilizzare anche la funzione di scripting di OmegaT per gestire le memorie di traduzione. Un esempio di implementazione è la coppia di script Save TM As.

source: As described above, OmegaT has, at the time of writing (November 2020), no functions of its own for managing translation memories; you must manage them yourself in your file manager.
it_it: Come sopra descritto, OmegaT non dispone, al momento (novembre 2020), di funzioni proprie per la gestione delle memorie di traduzione; si devono gestire manualmente nel file manager.

source: As its name suggests, in the per-job project method you create a new project for each job.
it_it: Come suggerisce il nome, nel metodo del progetto per ciascun lavoro si crea un nuovo progetto per ogni lavoro.

source: As standard, the project's translation memory folder is at <project>\tm\ (where <project> is the project's main or "root" folder).
it_it: Di norma, la cartella della memoria di traduzione del progetto si trova in <progetto>\tm\ (dove <progetto> è la cartella principale o "root" del progetto).

source: Bear in mind that if you follow the procedure above, the TM of the current project will also be present in the \tm\ of the current project as soon as you create the translated documents, so you will then start seeing matches and search results appearing to be from legacy projects that are in fact from the present project.
it_it: Si tenga presente che seguendo la procedura sopra descritta, la TM del progetto corrente sarà presente anche nella \tm\ del progetto corrente non appena si creeranno i documenti tradotti, quindi si inizieranno a vedere corrispondenze e risultati di ricerca provenire da progetti legacy che in realtà provengono dal progetto attuale.

source: By default, the script saves the output TM to a particular folder according to the first three characters of its name.
it_it: Per default, lo script salva la TM di output in una cartella particolare in base ai primi tre caratteri del suo nome.

source: Confirm with OK.
it_it: Si conferma con OK.

source: Consequently, once you have removed files from \source\ after translation and you load the project again, the editor no longer shows you the content of these files.
it_it: Di conseguenza, una volta rimossi i file da \source\ dopo la traduzione e caricato nuovamente il progetto, l'editor non mostra più il contenuto di questi file.

source: Each project has internal, input and output translation memories.
it_it: Ogni progetto dispone di memorie di traduzione interne, di input e di output.

source: Each translation unit consists of a pair of segments: the segment in the original text, and the segment in the translation.
it_it: Ogni unità di traduzione è composta da una coppia di segmenti: il segmento nel testo originale e quello nella traduzione.

source: Equally, using the recycled project method does not prevent you from having separate projects for different customers, different subjects, etc., or adding input translation memories selectively for each project.
it_it: Allo stesso modo, l'utilizzo del metodo del progetto riciclato non impedisce di avere progetti separati per clienti diversi, soggetti diversi, ecc., o di aggiungere memorie di traduzione in input in modo selettivo per ciascun progetto.

source: First create a repository, e.g. named TM-repository, in your home folder (e.g. at C:\Users\Me\TM-repository on Windows 10 or /home/Me/TM-repository on Linux.
it_it: Per prima cosa si crea un repository, ad esempio denominato TM-repository, nella cartella home (ad esempio in C:\Users\Me\TM-repository su Windows 10 o /home/Me/TM-repository su Linux.

source: For example:
it_it: Per esempio:

source: For more details of the differences between the three variants of output translation memories, refer to the OmegaT manual.
it_it: Per maggiori dettagli sulle differenze tra le tre varianti di memorie di traduzione di output, fare riferimento al manuale di OmegaT.

source: General
it_it: Generale

source: Here is an example of how this command can be used to manage your translation memories.
it_it: Ecco un esempio di come è possibile utilizzare questo comando per gestire le memorie di traduzione.

source: Here we have an idiosyncrasy of OmegaT: there is no function within OmegaT itself for copying, moving or exporting output translation memories to a chosen location.
it_it: Qui abbiamo una particolarità di OmegaT: non esiste alcuna funzione all'interno di OmegaT stesso per copiare, spostare o esportare le memorie di traduzione di output in una posizione prescelta.

source: Hitting Ctrl-d in OmegaT causes your translated documents (e.g. a translation in a Word file, if your source text was also a Word file) to be created.
it_it: Premendo Ctrl-d in OmegaT si creano i documenti tradotti (ad esempio una traduzione in un file Word, se anche il testo di origine era un file Word).

source: HowTo: Managing translation memories in OmegaT
it_it: HowTo: Gestione delle memorie di traduzione in OmegaT

source: However, if you have a folder on your computer in which you have collected translation memories, you can make this folder the project's translation memory folder by selecting in it OmegaT using Project > Properties, then hitting the Browse button next to Translation Memory Folder.
it_it: Tuttavia, se sul computer è presente una cartella in cui sono state raccolte memorie di traduzione, si può rendere questa cartella quella della memoria di traduzione del progetto selezionando OmegaT utilizzando Progetto > Proprietà, e poi premendo il pulsante Sfoglia accanto a "Cartella della memoria di traduzione".

source: However, if you have tens or even hundreds of possibly useful translation memories from past jobs (e.g. in the same language combination, in the same subject, for the same customer), it is of course tedious to go looking for them in your file manager and copy them individually into the project's \tm\ folder each time you start a new job.
it_it: Tuttavia, se si dispone di decine o addirittura centinaia di memorie di traduzione, forse utili, di lavori passati (ad esempio nella stessa combinazione linguistica, nello stesso argomento, per lo stesso cliente), ovviamente è noioso cercarle nel file manager e copiale singolarmente nella cartella \tm\ del progetto ogni volta che si inizia un nuovo lavoro.

source: However, their segments are still present in the internal translation memory, and will be presented to you as matches or search results.
it_it: Tuttavia, i loro segmenti sono ancora presenti nella memoria di traduzione interna e verranno presentati come corrispondenze o risultati di ricerca.

source: If you are familiar with symbolic links, you have a powerful tool for managing your TMs. They enable you for example to have separate repositories for each customer, but at the same time to build up subject-based repositories by linking TMs relevant to the subject from the customer repository to the relevant subject repository.
it_it: Se si ha familiarità con i link simbolici, si ha a disposizione un potente strumento per gestire le TM. Consentono, ad esempio, di avere archivi separati per ciascun cliente, ma allo stesso tempo di creare archivi basati sull'argomento collegando le TM rilevanti per l'argomento dall'archivio del cliente all'archivio del soggetto pertinente.

source: If you are not sure whether OmegaT has loaded an input TM, a simple way of checking is to search (with Ctrl-f) for a word or phrase that you know to be in it.
it_it: Se non si è sicuri che OmegaT abbia caricato una TM di input, un modo semplice per verificarlo è cercare (con Ctrl-f) una parola o una frase che si sa essere contenuta in essa.

source: If you create a new project for each job, segments in fuzzy matches and text searches are accompanied by an indication of the project in which they were produced.
it_it: Se si crea un nuovo progetto per ogni lavoro, i segmenti in corrispondenze fuzzy e ricerche testuali sono accompagnati dall'indicazione del progetto in cui sono stati prodotti.

source: If you name your projects intelligently (for example indicating the customer, subject, and/or approximate date of the project), this information is therefore provided along with the match.
it_it: Dando un nome intelligente ai progetti (indicando ad esempio il cliente, l'oggetto e/o la data approssimativa del progetto), queste informazioni verranno poi fornite insieme alla corrispondenza.

source: If you select this TM-repository folder as your \tm\ folder in future projects, translation memories in it will then be imported into those projects.
it_it: Selezionando questa cartella del repository TM come cartella \tm\ nei progetti futuri, le memorie di traduzione in essa contenute verranno importate in tali progetti.

source: If you use the per-job project method, you can create an empty project with all the desired settings (language combination, a particular \tm\ repository, etc.) and use it as a template for relevant jobs.
it_it: Se si usa il metodo del progetto per singolo lavoro, si può creare un progetto vuoto con tutte le impostazioni desiderate (combinazione linguistica, un particolare repository \tm\, ecc.) e utilizzarlo come modello per i lavori rilevanti.

source: If you use the recycled project method and have multiple recycled projects or use the per-project method but use template projects (e.g. for different subjects), you can then set up your recycled project or project template to save the output TM to a dedicated repository folder, rather than exporting all output TMs to the same folder.
it_it: Se si usa il metodo del progetto riciclato e si dispone di più progetti riciclati o si usa il metodo per singolo progetto ma si usano i template dei progetti (ad esempio per soggetti diversi), si può impostare il progetto riciclato o il template del progetto per salvare la TM di output in una cartella dedicata del repository, anziché esportare tutte le TM di output nella stessa cartella.

source: In order for OmegaT to make use of them, place them in the project's \tm\ folder before loading the project (or, if the project is already loaded, re-load it again).
it_it: Per consentire a OmegaT di utilizzarle, si inseriscono nella cartella \tm\ del progetto prima di caricare il progetto (o, se il progetto è già caricato, ricaricarlo di nuovo).

source: In particular, if you are willing to get to grips with scripts, the possibilities are endless.
it_it: In particolare, se si è disposti a fare i conti con gli script, le possibilità sono infinite.

source: In this HowTo, "a translation memory" therefore refers to a file.
it_it: In questo HowTo con "una memoria di traduzione" si intende quindi un file.

source: In this case, access it in the Project Properties dialog after enabling it in Preferences.
it_it: In questo caso, accedervi nella finestra di dialogo Proprietà progetto dopo averlo abilitato in Preferenze.

source: In this field, enter the following command:
it_it: In questo campo, inserisci il seguente comando:

source: Individual segments in input TMs are displayed to you when a segment identical or similar to the active segment (full match or fuzzy match) is found.
it_it: I singoli segmenti nelle TM di input vengono visualizzati quando viene trovato un segmento identico o simile al segmento attivo (corrispondenza completa o corrispondenza parziale).

source: Input translation memories
it_it: Le memorie di traduzione di input

source: Input translation memories are translation memories created from past translations that are to be used in the active project for reference.
it_it: Le memorie di traduzione di input sono memorie di traduzione create da traduzioni precedenti che devono essere utilizzate come riferimento nel progetto attivo.

source: Insert your own user name instead of Me).
it_it: Si inserisce il proprio nome utente al posto di Me).

source: Instead, if they have been placed in the \tm\ folder, they are loaded automatically by OmegaT when the project is opened.
it_it: Se invece sono state posizionate nella cartella \tm\, vengono caricate automaticamente da OmegaT all'apertura del progetto.

source: Instead, it is much more practical to collect translation memories in different folders ("repositories") according to language combination, subject, etc., and then, when you create a new project, simply to select the relevant folder using Project > Properties > Translation Memory Folder (Browse).
it_it: È invece molto più pratico raccogliere le memorie di traduzione in cartelle diverse ("repository") a seconda della combinazione linguistica, dell'argomento, ecc., e poi, quando si crea un nuovo progetto, basta selezionare la relativa cartella utilizzando Progetto > Proprietà > Cartella della memoria di traduzione (Sfoglia).

source: It also creates an output translation memory of the project.
it_it: Si crea inoltre una memoria di traduzione di output del progetto.

source: It does however have ways by which you can extend its own functionality by means of scripts.
it_it: Dispone tuttavia di modi con cui è possibile estendere le proprie funzionalità tramite script.

source: It is the file project_save.tmx and can be found in the project's \omegat\ folder.
it_it: È il file project_save.tmx e si trova nella cartella \omegat\ del progetto.

source: It is therefore empty when the project is first created.
it_it: È quindi vuoto quando il progetto viene creato per la prima volta.

source: It recognizes translation memories only in the context of a project.
it_it: Riconosce le memorie di traduzione solo nel contesto di un progetto.

source: Linux, Windows and Mac OSX all support symbolic links, though their use is more user-friendly on some operating systems than others.
it_it: Linux, Windows e Mac OSX supportano tutti i link simbolici, sebbene il loro utilizzo sia più user-friendly su alcuni sistemi operativi rispetto ad altri.

source: Methods of managing translation memories when using OmegaT
it_it: Metodi di gestione delle memorie di traduzione utilizzando OmegaT

source: Now, whenever you create your target documents, the output TM of the project will be copied automatically to the TM-repository folder.
it_it: Ora, ogni volta che si creano i documenti di destinazione, la TM di output del progetto verrà copiata automaticamente nella cartella del repository TM.

source: OmegaT does not have a function with which the user can open input translation memory files directly.
it_it: OmegaT non dispone di una funzione con la quale l'utente può aprire direttamente i file di memoria di traduzione di input.

source: OmegaT is project oriented.
it_it: OmegaT è orientato al progetto.

source: OmegaT stores translation memories in the industry-standard TMX file format.
it_it: OmegaT memorizza le memorie di traduzione nel formato di file TMX standard.

source: Once you have selected a different translation memory folder, OmegaT regards it as being part of the project.
it_it: Una volta selezionata una cartella diversa della memoria di traduzione, OmegaT la considera parte del progetto.

source: Once you have understood the concept of projects and input and output TMs, this is not difficult.
it_it: Una volta compreso il concetto di progetti e TM di input e output, questo non è difficile.

source: One drawback concerns orphan segments.
it_it: Uno svantaggio riguarda i segmenti orfani.

source: One of these is the external post-processing command.
it_it: Uno di questi è il comando di post-processing esterno.

source: Orphan segments are segments that were translated in the current project but are no longer present in the files in the \source\ folder.
it_it: I segmenti orfani sono segmenti che sono stati tradotti nel progetto corrente ma non sono più presenti nei file nella cartella \source\.

source: Output translation memories
it_it: Le memorie di traduzione di output

source: Selecting a translation memory folder in this way instructs OmegaT to look for the input translation memories there instead of in the default location of <project>\tm\.
it_it: Selezionando una cartella di memoria di traduzione in questo modo si indica a OmegaT di cercare le memorie di traduzione di input lì invece che nella posizione predefinita di <progetto>\tm\.

source: Such segments may be "half-finished", rough translations, but they are still available to you, and useful in these cases.
it_it: Tali segmenti possono essere traduzioni "incompiute" e approssimative, ma sono comunque disponibili e utili in questi casi.

source: Symbolic links are a function provided by your operating system.
it_it: I link simbolici sono una funzione fornita dal sistema operativo.

source: The OmegaT philosophy
it_it: La filosofia di OmegaT

source: The OmegaT program does not have its "own" translation memory.
it_it: Il programma OmegaT non dispone di una "propria" memoria di traduzione.

source: The benefit of this kind of management is that you spend less time moving TM files around each time you create a new project, and do not have duplicate copies of TMs taking up space.
it_it: Il vantaggio di questo tipo di gestione è che si spende meno tempo a spostare i file TM ogni volta che si crea un nuovo progetto e non si hanno copie duplicate delle TM che occupano spazio.

source: The editor pane of OmegaT only displays the content of files that are in \source\ when the project is loaded.
it_it: Il pannello dell'editor di OmegaT visualizza solo il contenuto dei file che si trovano in \source\ quando il progetto viene caricato.

source: The internal project translation memory is used by the OmegaT program and as the user, you do not normally need to deal with it.
it_it: La memoria di traduzione interna del progetto viene utilizzata dal programma OmegaT e come utente normalmente non è necessario occuparsene.

source: The internal translation memory
it_it: La memoria di traduzione interna

source: The internal translation memory is the project's own TM, which remains within the project, i.e. it is not used in other projects.
it_it: La memoria di traduzione interna è la TM del progetto, che rimane all'interno del progetto, ovvero non viene utilizzata in altri progetti.

source: The per-job project method
it_it: Il metodo del progetto per ciascun lavoro

source: The recycled project method
it_it: Il metodo del riciclo del progetto

source: The recycled project method also has drawbacks, however.
it_it: Il metodo del progetto riciclato presenta però anche degli inconvenienti.

source: The text contained in these three files is identical; they differ only in the amount of formatting information they also contain.
it_it: Il testo contenuto in questi tre file è identico; differiscono solo per la quantità di informazioni di formattazione che contengono.

source: Then hit Options > Preferences > Saving and Output to display the External Post-processing Command field.
it_it: Quindi si preme Opzioni > Preferenze > Salvataggio e output per visualizzare il campo Comando Post-processing Esterno.

source: There are means of automating this process (see below), but ultimately, it is your responsibility to decide how you organize your repositories.
it_it: Esistono mezzi per automatizzare questo processo (vedi sotto), ma in definitiva è una propria responsabilità decidere come organizzare i repository.

source: There are numerous ways of doing this, and OmegaT leaves it very much up to you, the user, how you go about it.
it_it: Esistono numerosi modi per farlo e OmegaT lascia molto all'utente la scelta di come procedere.

source: There is no limit to the number of input translation memories (i.e. individual TMX files) you can have in a project.
it_it: Non esiste alcun limite al numero di memorie di traduzione di input (ovvero singoli file TMX) che si possono avere in un progetto.

source: These are not the only possible ways of managing OmegaT projects.
it_it: Queste non sono le uniche modalità possibili per gestire i progetti OmegaT.

source: These orphan segments are not included in the output TM. In a "recycled" project though, they are still present, but indistinguishable from any other segments in completed translations.
it_it: Questi segmenti orfani non vengono inclusi nella TM di output. In un progetto "riciclato", tuttavia, sono ancora presenti, ma indistinguibili da qualsiasi altro segmento nelle traduzioni completate.
